app/controllers/contacts_controller.rb

SELECT "contacts".* FROM "contacts"
---
  def index
    @contacts = Contact.all.reverse

INSERT INTO "contacts" ("name", "contact_info", "message", "created_at", "updated_at", "subject") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"
---
  def create
    @contact = Contact.new(contact_params)

    if @contact.save