app/controllers/events_controller.rb

SELECT "events".* FROM "events"
---
  def index
    @events = Event.all.reverse()

INSERT INTO "events" ("date", "imgurl", "organizer", "venue", "artists", "supporting_artists", "ticket_link", "created_at", "updated_at", "past_event") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10) RETURNING "id"
---
  def create
    @event = Event.new(event_params)

    if @event.save

UPDATE "events" SET "imgurl" = $1, "updated_at" = $2 WHERE "events"."id" = $3  [["imgurl", "https://i.imgur.com/7cgPqHQ.jpg"], ["updated_at", "2020-02-11 08:08:13.837413"], ["id", 6]]
---
  def update
    if @event.update(event_params)