app/controllers/merches_controller.rb

  def index
    @merches = Merch.all
---
SELECT "merches".* FROM "merches"

  def create
    @merch = Merch.new(merch_params)

    if @merch.save
---
INSERT INTO "merches" ("img_url", "title", "description", "link_to_merch", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["img_url", "great"], ["title", "site"], ["description", "bro"], ["link_to_merch", "yes"], ["created_at", "2020-01-16 22:31:21.992927"], ["updated_at", "2020-01-16 22:31:21.992927"]]

  def update
    if @merch.update(merch_params)
---
UPDATE "merches" SET "description" = $1, "link_to_merch" = $2, "updated_at" = $3 WHERE "merches"."id" = $4  [["description", "sevilasdasdsd"], ["link_to_merch", "she hit the florasdsad"], ["updated_at", "2020-01-20 23:28:36.055444"], ["id", 72]]

  def destroy
    @merch.destroy
---
DELETE FROM "merches" WHERE "merches"."id" = $1  [["id", 45]]

    def set_merch
      @merch = Merch.find(params[:id])
---
SELECT "merches".* FROM "merches" WHERE "merches"."id" = $1 LIMIT $2  [["id", 45], ["LIMIT", 1]]